<a href="https://colab.research.google.com/github/gyujin0450/Rstudy/blob/master/202_%EB%8D%B0%EC%9D%B4%ED%84%B0%EA%B0%80%EA%B3%B5(1)_p35.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

데이터 가공

In [ ]:
# 성적데이터(sungjuk.rdata) 읽어오기
# 코랩에 파일을 드래그해서 올리고 실습함

In [1]:
load('sungjuk.rdata') # R 전용 데이터 읽어옴
sungjuk

  name eng mat sci
1 John 90  85  90
2 Tom  95  96  80
3 Mark 69  49  70
4 Jane 78  95  60

In [3]:
# 총점과 평균을 계산하여 tot, avg 라는 컬럼 생성(방법1)
sungjuk$tot <- sungjuk$eng + sungjuk$mat + sungjuk$sci
sungjuk$avg <- sungjuk$tot / 3
sungjuk

  name eng mat sci tot avg
1 John 90  85  90  265 88.33333
2 Tom  95  96  80  271 90.33333
3 Mark 69  49  70  188 62.66667
4 Jane 78  95  60  233 77.66667

In [4]:
# 총점과 평균을 계산하여 tot, avg 라는 컬럼 생성(방법2)
sungjuk <- within(sungjuk, {
              tot <- eng + mat + sci
              avg <- tot / 3
           })
sungjuk

  name eng mat sci tot avg
1 John 90  85  90  265 88.33333
2 Tom  95  96  80  271 90.33333
3 Mark 69  49  70  188 62.66667
4 Jane 78  95  60  233 77.66667

In [5]:
# 정렬 : order(컬럼명,...)
# 성적데이터를 평균을 기준으로 정렬
order(sungjuk$avg)  #  각 데이터별 정렬 순번 출력

[1] 3 4 1 2

In [6]:
rn <- order(sungjuk$avg) # 오름차순
sungjuk[rn,]

  name eng mat sci tot avg
3 Mark 69  49  70  188 62.66667
4 Jane 78  95  60  233 77.66667
1 John 90  85  90  265 88.33333
2 Tom  95  96  80  271 90.33333

In [7]:
rn <- order(-sungjuk$avg) # 내림차순
sungjuk[rn,]

  name eng mat sci tot avg
2 Tom  95  96  80  271 90.33333
1 John 90  85  90  265 88.33333
4 Jane 78  95  60  233 77.66667
3 Mark 69  49  70  188 62.66667